source/BusinessProcesses/ObrabotkaKadrovogoIzmeneniya.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<BusinessProcess>
		<Properties>
			<Name>ObrabotkaKadrovogoIzmeneniya</Name>
			<Task>Task.ZadachaPoKadrovomuIzmeneniyu</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>KadrovoyeIzmenenie</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.KadrovoyeIzmenenie</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Sotrudnik</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Sotrudniki</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VidIzmeneniya</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VidyKadrovykhIzmeneniy</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StatusUvedomleniya</Name>
					<Type>
						<v8:Type>cfg:EnumRef.StatusyUvedomleniy</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

source/BusinessProcesses/ObrabotkaKadrovogoIzmeneniya/Ext/ObjectModule.bsl
// Маршрут контролирует подготовку и результат; сетевых вызовов внутри задач нет.
Процедура ПередЗаписью(Отказ)
    Если ОбменДанными.Загрузка Тогда
        Отказ = Истина;
        Сообщить("Прямая загрузка этого служебного объекта через обмен не поддерживается.");
        Возврат;
    КонецЕсли;
    Если НЕ ЗначениеЗаполнено(KadrovoyeIzmenenie) Тогда
        Отказ = Истина;
        Сообщить("Выберите кадровое изменение для маршрута контроля.");
        Возврат;
    КонецЕсли;
    Sotrudnik = KadrovoyeIzmenenie.Sotrudnik;
    VidIzmeneniya = KadrovoyeIzmenenie.VidIzmeneniya;
КонецПроцедуры
